public class InterfaceProblem {
    public static void main(String[] args) {
        // 앞서 이야기 했듯이 게임을 하나 만들어봅시다.
        // qSkill, wSkill 두 개 정도를 만들고
        // 캐릭터가 많으면 힘드니까 전사, 마법사 정도로 처리하면 되겠습니다.
        // 여기서도 모험가 -> 전사 -> 2차 전직(전사)
        //         모험가 -> 법사 -> 2차 전직(법사)
        // 이와 같은 형식으로 설정도 가능할 것입니다.

        //캐릭터를 생성하자.닉네임을 만들고 처음에는 모험가로 시작한다.
        //레벨이 5가 되면 전사나 법사 둘 중 하나를 선택할 수 있게 하고
        //레벨이 10이 되면 2차 전직을 하여 전사를 택했다면 더 강력한 2차 전사로
        //법사를 택했다면 2차 법사로 되게 해본다.
        //qskill과 wskill을 q나 w를 누르면 활성화 할 수 있게 하고 다른 키를 누르면 다시 누르라고 묻는다.
        //몹은 HP를 100으로 설정하고 스킬이 발동할 시 1 ~ 10까지의 랜덤 대미자가 들어가게 설정을 한다.
        //몹을 만들고 많이 죽일수록 경험치가 쌓여 레벨이 올라가게 해보자
        //레벨이 1씩 오를 때마다 데미지가 10씩 더 들어가게 설정한다
        //레벨업 기준치를 1000으로 두고 200단위로 레벨이 올라갈 수록 더 채우도록 해보자.
        //스킬 입력시 스킬이 발동하게 작동
        //레벨이 15가 되면 클리어 조건을 만들어본다.











    }
}
