public class Home1 {
    // 65 ~ 122 사이의 랜덤한 문자를 생성하도록 한다.
    // 여기서 소문자나 대문자가 아니라면 다시 생성하도록 프로그램을 만들어보자
    // 65 ~ 122 사이의 랜덤한 문자를 생성하도록한다.
    // min에 65최솟값 max에 122최댓값을 준다.
    // range = max - min + 1주고
    // int n = 에 Maht.random() + range + min 을 준다.
    // while 문을 사용하여 반복하므로
    // boolean =true를 주고
    // while문에 랜덤수를 계속 바꿀수 있게 랜덤변수를 넣어준다.
    // 65이상 90이하 변수를 만든다.(소문자)
    // 97이상 122이하 변수를 만든다.(대문자)
    // if문을 사용하여 소문자 or 대문자 하여 참이면 영문자 대소문자중에 하나로 넣고
    // 그다음에 빠져나간다.
    // 빠져나간곳에 아니라면 영문자 대문자가 아닌것을 넣는다..
}
