public class StudentClass {
    public static void main(String[] args) {
        //학생 클래스에 수학, 영어, 국어 점수를 입력 받도록 개조합니다.
        //학생 클래스의 평균을 계산해봅시다.

        //★★★★★★★★★★문제를 제대로 안 읽고 풀었음 ★★★★★★★★★★★★★★★★★★★★

        // 학생 인원수
        // 수학 영어 국어 점수 -> 따로따로 메소드를 작성?
        // 점수 랜덤 0~100 -> range
        // 평균계산
        //반이 아니라 그냥 개인의 수학 영어 국어 점수인거같네...

        Average avg = new Average();

        //배열 avg의 각 인덱스가 나타내는 것이 어떤 과목의 평균인지 나타내는게 좋을려나
        //그러면 어떻게 해야할지 생각해보자
       avg.avgAll();









    }
}
