public class Homework10 {
    public static void main(String[] args) {
        //2개의 배열을 만든다.
        //하나는 과일을 담는 장바구니 배열
        //하나는 해당 과일의 개수가 들어있는 배열이다.
        //사과 5, 귤 3, 오렌지 5, 수박 2, 메론 3, 포도 4개를 배열로 표현하고
        //적당한 값을 매겨서 합산 가격을 출력하도록 프로그래밍 하시오.

        String[] fruit = new String[6];
        int[] quantity = {5, 3, 5, 2, 3, 4};

        //이렇게 일일히 나열하는거 맞나
        fruit[0] = "사과";
        fruit[1] = "귤";
        fruit[2] = "오렌지";
        fruit[3] = "수박";
        fruit[4] = "메론";
        fruit[5] = "포도";

        int[] price = {1000, 2000, 1500, 3000, 3500, 2000};

        //각각의 과일에 가격과 개수를 연결하는 방법을 모르겠다




    }
}
