public class Q9번문제 {
    public static void main(String[] args) {
        // 9. 1 ~ 100까지의 숫자를 순회한다.
        //    2 ~ 10 사이의 랜덤한 숫자를 선택하고 이 숫자의 배수를 출력한다.
        //    다음 루프에서 다시 랜덤 숫자를 선택하고 해당 숫자의 배수를 출력한다.
        //    그 다음 루프에서 다시 작업을 반복한다.
        //    끝까지 순회 했을때 출력된 숫자들의 합은 얼마인가 ?

        int i = 0;
        int sum = 0;

        while(i++<100) {
            int rand = (int) (Math.random(*9+2);

        //  Q. 질문노트
            // 9. 1 ~ 100까지의 숫자를 순회한다.
            //    2 ~ 10 사이의 랜덤한 숫자를 선택하고 이 숫자의 배수를 출력한다.
        // 해당부분까지 문제를 이해하고 진행했습니다.

    }
}